erstec/APRS-ESP/lib/LibAPRS_ESP32/AFSK.cpp
#include "driver/sigmadelta.h"

extern "C"
{
#include "soc/syscon_reg.h"
#include "soc/syscon_struct.h"
}

#define DEBUG_TNC

extern unsigned long custom_preamble;
extern unsigned long custom_tail;
int adcVal;

bool input_HPF = false;
bool input_BPF = false;

static const adc_unit_t unit = ADC_UNIT_1;

void sample_isr();
bool hw_afsk_dac_isr = false;

static filter_t bpf;
static filter_t lpf;
static filter_t hpf;

Afsk *AFSK_modem;

#define ADC_RESULT_BYTE 4
#define ADC_CONV_LIMIT_EN 0

static bool check_valid_data(const adc_digi_output_data_t *data);

#define TIMES 1920
#define GET_UNIT(x) ((x >> 3) & 0x1)
static uint16_t adc1_chan_mask = BIT(0);
static uint16_t adc2_chan_mask = 0;
static adc_channel_t channel[1] = {(adc_channel_t)ADC1_CHANNEL_0};
static const char *TAG = "--(TAG ADC DMA)--";
#define ADC_OUTPUT_TYPE ADC_DIGI_OUTPUT_FORMAT_TYPE2

static void continuous_adc_init(uint16_t adc1_chan_mask, uint16_t adc2_chan_mask, adc_channel_t *channel, uint8_t channel_num)
{
  // channel[0] = (adc_channel_t)digitalPinToAnalogChannel(1);
  log_d("adc_digi_initialize");

  adc_digi_init_config_t adc_dma_config = {
      .max_store_buf_size = 8 * TIMES,
      .conv_num_each_intr = TIMES,
      .adc1_chan_mask = adc1_chan_mask,
      .adc2_chan_mask = adc2_chan_mask,
  };

  ESP_ERROR_CHECK(adc_digi_initialize(&adc_dma_config));

  log_d("adc_digi_config");
  adc_digi_configuration_t dig_cfg = {
      .conv_limit_en = ADC_CONV_LIMIT_EN,
      .conv_limit_num = 250,
      .sample_freq_hz = SAMPLERATE,
      .conv_mode = ADC_CONV_SINGLE_UNIT_1,   ////ESP32 only supports ADC1 DMA mode
      .format = ADC_DIGI_OUTPUT_FORMAT_TYPE2 // ADC_DIGI_OUTPUT_FORMAT_TYPE2,
  };

  adc_digi_pattern_config_t adc_pattern[SOC_ADC_PATT_LEN_MAX] = {0};
  dig_cfg.pattern_num = channel_num;

  log_d("adc_digi_controller");
  int i = 0;
  for (int i = 0; i < channel_num; i++)
  {
    uint8_t unit = GET_UNIT(channel[i]);
    uint8_t ch = channel[i] & 0x7;
    adc_pattern[i].atten = ADC_ATTEN_DB_11;
    adc_pattern[i].channel = ch;
    adc_pattern[i].unit = unit;
    adc_pattern[i].bit_width = SOC_ADC_DIGI_MAX_BITWIDTH; // 11 data bits limit

    ESP_LOGI(TAG, "adc_pattern[%d].atten is :%x", i, adc_pattern[i].atten);
    ESP_LOGI(TAG, "adc_pattern[%d].channel is :%x", i, adc_pattern[i].channel);
    ESP_LOGI(TAG, "adc_pattern[%d].unit is :%x", i, adc_pattern[i].unit);
  }
  dig_cfg.adc_pattern = adc_pattern;
  ESP_ERROR_CHECK(adc_digi_controller_configure(&dig_cfg));
}

#if !CONFIG_IDF_TARGET_ESP32
static bool check_valid_data(const adc_digi_output_data_t *data)
{
  const unsigned int unit = data->type2.unit;
  if (unit > 0)
    return false;
  if (data->type2.channel > 0)
    return false;
  return true;
}
#endif


esp_err_t adc_init()
{
  esp_err_t error_code;

  continuous_adc_init(adc1_chan_mask, adc2_chan_mask, channel, sizeof(channel) / sizeof(adc_channel_t));
  // continuous_adc_init(0, 0, channel, 1);
  //  error_code = adc1_config_width(ADC_WIDTH_BIT_12);
  //  log_d("adc1_config_width error_code=%d", error_code);

  // if (error_code != ESP_OK)
  // {
  //   return error_code;
  // }
  adc_digi_start();

  return ESP_OK;
}

void adcActive(bool sts)
{
  if (sts){
    //adc_init();
    adc_digi_start();
    hw_afsk_dac_isr=0;
  }else{
    adc_digi_stop();
    //adc_digi_deinitialize();
  }
}

int IRAM_ATTR read_adc_dma(uint32_t *ret_num, uint8_t *result)
{
  esp_err_t ret;
  ret = adc_digi_read_bytes(result, TIMES, ret_num, ADC_MAX_DELAY);
  return ret;
}

uint8_t CountOnesFromInteger(uint8_t value)
{
  uint8_t count;
  for (count = 0; value != 0; count++, value &= value - 1)
    ;
  return count;
}

#define IMPLEMENTATION FIFO

cppQueue adcq(sizeof(int16_t), 19200, IMPLEMENTATION); // Instantiate queue

// Forward declerations
int afsk_getchar(void);
void afsk_putchar(char c);

hw_timer_t *timer = NULL;

void AFSK_TimerEnable(bool sts)
{
  if (timer == NULL)
    return;
  if (sts == true)
    timerAlarmEnable(timer);
  else
    timerAlarmDisable(timer);
}

void LED_Color(uint8_t r, uint8_t g, uint8_t b)
{
  strip.setPixelColor(0, strip.Color(r, g, b));
  strip.show();
}

bool getTransmit()
{
  bool ret=false;
  if (digitalRead(PTT_PIN) == 0)
    ret = true;
  if(hw_afsk_dac_isr) ret=true;
  return ret;
}

bool getReceive()
{
  bool ret=false;
  if (digitalRead(PTT_PIN) == 0) return true; //PTT Protection receive
  if(AFSK_modem->hdlc.receiving==true) ret=true;
  return ret;
}

void afskSetHPF(bool val)
{
  input_HPF=val;
}
void afskSetBPF(bool val)
{
  input_BPF=val;
}

uint32_t ret_num;
uint8_t *resultADC;

void AFSK_hw_init(void)
{
  // Set up ADC
  log_d("AFSK hardware Initialize");
  // pinMode(RSSI_PIN, INPUT_PULLUP);
  pinMode(PTT_PIN, OUTPUT);
  pinMode(17, OUTPUT); // MIC_SEL
  pinMode(18, OUTPUT); // ESP2MIC
  pinMode(1, ANALOG);  // AUDIO2ESP

  digitalWrite(17, HIGH);
  digitalWrite(PTT_PIN, HIGH); // PTT not active

  resultADC = (uint8_t *)malloc(TIMES * sizeof(uint8_t));

  adc_init();

  sigmadelta_config_t sdm_config{
      .channel = SIGMADELTA_CHANNEL_0,
      .sigmadelta_duty = 127,    /*!< Sigma-delta duty, duty ranges from -128 to 127. */
      .sigmadelta_prescale = 96, /*!< Sigma-delta prescale, prescale ranges from 0 to 255. */
      .sigmadelta_gpio = MIC_PIN};
  sigmadelta_config(&sdm_config);
  // Sample the play the audio on the DAC.
  timer = timerBegin(0, 4, true);                                                // 80MHz%4 = 20MHz hardware clock
  timerAttachInterrupt(timer, &sample_isr, true);                                // Attaches the handler function to the timer
  timerAlarmWrite(timer, (uint64_t)20000000 / CONFIG_AFSK_DAC_SAMPLERATE, true); // Interrupts when counter == 20MHz/CONFIG_AFSK_DAC_SAMPLERATE
  timerAlarmEnable(timer);
  AFSK_TimerEnable(false);
}

void AFSK_init(Afsk *afsk)
{
  log_d("AFSK software Initialize");
  // Allocate modem struct memory
  memset(afsk, 0, sizeof(*afsk));
  AFSK_modem = afsk;
  // Set phase increment
  afsk->phaseInc = MARK_INC;
  // Initialise FIFO buffers
  fifo_init(&afsk->rxFifo, afsk->rxBuf, sizeof(afsk->rxBuf));
  fifo_init(&afsk->txFifo, afsk->txBuf, sizeof(afsk->txBuf));

  // filter initialize
  filter_param_t flt = {
      .size = FIR_LPF_N,
      .sampling_freq = SAMPLERATE,
      .pass_freq = 0,
      .cutoff_freq = 1200,
  };
  int16_t *lpf_an, *bpf_an, *hpf_an;
  // LPF
  lpf_an = filter_coeff(&flt);
  // BPF
  flt.size = FIR_BPF_N;
  flt.pass_freq = 1000;
  flt.cutoff_freq = 2500;
  bpf_an = filter_coeff(&flt);

  // LPF
  filter_init(&lpf, lpf_an, FIR_LPF_N);
  // BPF
  filter_init(&bpf, bpf_an, FIR_BPF_N);

  // HPF
  flt.size = FIR_BPF_N;
  flt.pass_freq = 1000;
  flt.cutoff_freq = 6000;
  hpf_an = filter_coeff(&flt);
  filter_init(&hpf, hpf_an, FIR_BPF_N);

