erstec/APRS-ESP/lib/LibAPRS_ESP32/AFSK.cpp
extern void APRS_poll();
uint8_t poll_timer = 0;
// int adc_count = 0;
int offset_new = 0, offset = 2090, offset_count = 0;

portMUX_TYPE timerMux = portMUX_INITIALIZER_UNLOCKED;
double sinwave;

void IRAM_ATTR sample_isr()
{
  if (hw_afsk_dac_isr)
  {
    portENTER_CRITICAL_ISR(&timerMux);          // ISR start
    sinwave = (double)AFSK_dac_isr(AFSK_modem); // Return sine wave value 0-255
    // Sigma-delta duty of one channel, the value ranges from -128 to 127, recommended range is -90 ~ 90.The waveform is more like a random one in this range.
    int8_t sine = (int8_t)((sinwave - 127) / 1.5); // Redue sine = -85 ~ 85
    sigmadelta_set_duty(SIGMADELTA_CHANNEL_0, sine);

    // End of packet
    if (AFSK_modem->sending == false)
    {
      digitalWrite(PTT_PIN, HIGH);
      AFSK_TimerEnable(false);
      // LED_TX_OFF();
    }
    portEXIT_CRITICAL_ISR(&timerMux); // ISR end
  }
}

bool tx_en = false;

extern int mVrms;
extern float dBV;
extern bool afskSync;

double Vrms = 0;
long mVsum = 0;
int mVsumCount = 0;
long lastVrms = 0;
bool VrmsFlag = false;
bool sqlActive = false;

void AFSK_Poll(bool isRF)
{
  int mV;
  int x = 0;
  size_t writeByte;
  int16_t adc;

  if (!hw_afsk_dac_isr)
  {
    memset(resultADC, 0xcc, TIMES * sizeof(uint8_t));
    esp_err_t ret = read_adc_dma(&ret_num, &resultADC[0]);
    if (ret == ESP_OK || ret == ESP_ERR_INVALID_STATE)
    {
      // ESP_LOGI("TASK:", "ret is %x, ret_num is %d", ret, ret_num);
      for (int i = 0; i < ret_num; i += ADC_RESULT_BYTE)
      {
        adc_digi_output_data_t *p = (adc_digi_output_data_t *)&resultADC[i];
        if (check_valid_data(p))
        {
          // if(i<100) log_d("ret%x i=%d  Unit: %d,_Channel: %d, Value: %d\n",ret, i, p->type2.unit, p->type2.channel, p->type2.data);
          adcVal = p->type2.data;
          offset_new += adcVal;
          offset_count++;
          if (offset_count >= ADC_SAMPLES_COUNT) // 192
          {
            offset = offset_new / offset_count;
            offset_count = 0;
            offset_new = 0;
            if (offset > 3000 || offset < 1000) // Over dc offset to default
              offset = 2090;
          }
          adcVal -= offset; // Convert unsinewave to sinewave, offset=1.762V ,raw=2090

          if (sync_flage == true)
          {
            mV = (int)((float)adcVal / 1.1862F); // ADC Raw to mV
            mVsum += powl(mV, 2);                // VRMS = √(1/n)(V1^2 +V2^2 + … + Vn^2)
            mVsumCount++;
          }

          if (input_HPF)
          {
            adcVal = (int)filter(&hpf, (int16_t)adcVal);
          }
          if (input_BPF)
          {
            adcVal = (int)filter(&bpf, (int16_t)adcVal);
          }

          AFSK_adc_isr(AFSK_modem, (int16_t)adcVal); // Process signal IIR
          if (i % PHASE_BITS == 0)
            APRS_poll(); // Poll check every 1 bit
        }
      }
      // Get mVrms on Sync affter flage 0x7E
      // if (afskSync == false)
      if (sync_flage == false)
      {
        if (mVsumCount > 500)
        {
          mVrms = sqrtl(mVsum / mVsumCount); // VRMS = √(1/mVsumCount)(mVsum)
          mVsum = 0;
          mVsumCount = 0;
          lastVrms = millis() + 500;
          VrmsFlag = true;
          // Tool conversion dBv <--> Vrms at http://sengpielaudio.com/calculator-db-volt.htm
          // dBV = 20.0F * log10(Vrms);
          log_d("Audio dc_offset=%d mVrms=%d", offset, mVrms);
        }
        if (millis() > lastVrms && VrmsFlag)
        {
          afskSync = true;
          VrmsFlag = false;
        }
      }
    }
  }
}


#endif
